blog-posts/2004-12-01-emacs-for-my-mom.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs for my Mom</title>
<!-- 2014-04-30 Wed 17:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Emacs for my Mom</h1>
<p>
December 1st, 2004 -
<a href="http://sachachua.com/blog/p/2454"><a href="http://sachachua.com/blog/p/2454">http://sachachua.com/blog/p/2454</a></a>
</p>

<blockquote>
<p>
Do you think Emacs is something we can learn?
</p>
</blockquote>

<p>
I think Emacs is something my parents can learn, but something they
 currently don't have reason to study. Even the PIM aspect won't be
 helpful, as my mom is really uses Outlook synchronization with mobile
 devices.
</p>

<p>
Right tool for the right job, I guess. =)
</p>

<p>
People sometimes try new things for the sheer heck of it. My dad tries
 different lighting techniques. My mom tries new ways of management. I
 try new sites and new software (mostly related to PIMs). We do that
 because we are interested in the topic and we can see the long-term
 benefits either directly caused by the tool or indirectly due to
 keeping our minds flexible. We serve as gateways (or gatekeepers?) for
 other people who don't have the time to explore these things.
</p>

<p>
Sometimes we're not looking for new ways to work. Sometimes we're just
 curious about stuff. That's cool, too. If my mom's curious about this
 software program I keep writing about, she can give it a whirl. =)
</p>

<p>
<a href="http://mindlube.com/products/emacs/index.html"><a href="http://mindlube.com/products/emacs/index.html">http://mindlube.com/products/emacs/index.html</a></a>
seems to have Emacs for
 Mac OS X, although I've never actually tried it because I don't have a
 Mac. (Hint? ;) ) Pick “Emacs for OS X (your version here)”. Err, I
 don't know what “mount the DMG disk image” means under Mac OS X, but
 it might be something you can find under the option-click (or one of
 those funky buttons) menu&#x2026;
</p>

<p>
Knowing my mom, hmmm&#x2026; I suggest trying out Tools: Games: Tetris
 first. =)
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
